{
  "target": {
    "game_name": "Burglin' Gnomes",
    "timestamp_utc": "2026-02-08T00:00:00Z"
  },
  "results": {
    "identity": {
      "developer": "Fobri",
      "publisher": "Fobri",
      "country": "unknown",
      "summary": "Burglin' Gnomes is developed and published by Fobri, a small independent studio that self-publishes the title on Steam. Public information focuses on the game itself and wishlist traction rather than the company’s background, and no clear country of origin is listed on major storefronts or data aggregators. Overall, Fobri appears to be a typical indie developer with a growing presence on Steam but limited publicly documented corporate history.",
      "sources": [
        "https://store.steampowered.com/app/3844970/",
        "https://steamdb.info/app/3844970/",
        "https://games-stats.com/steam/game/burglin-gnomes/",
        "https://www.gamedata.wtf/3844970.html"
      ]
    },
    "anti_cheat": {
      "type": "none",
      "classification": "none",
      "summary": "There is no indication that Burglin' Gnomes uses third-party DRM or anti-cheat solutions such as Denuvo, Easy Anti-Cheat, or kernel-level systems. The Steam store page and tracking sites list standard Steam platform requirements only, and there are no notes about additional DRM or anti-cheat layers. Based on currently available information, the game appears to rely solely on standard Steam infrastructure and does not employ invasive anti-cheat.",
      "sources": [
        "https://store.steampowered.com/app/3844970/",
        "https://steamdb.info/app/3844970/",
        "https://www.pcgamebenchmark.com/burglin-gnomes-system-requirements",
        "https://www.gamedata.wtf/3844970.html"
      ]
    },
    "community_sentiment": {
      "steam_label": "unknown",
      "steam_percentage": "unknown",
      "summary": "Burglin' Gnomes is listed on Steam as a coming-soon title with a demo and playtest activity, but the main store page currently shows no public user review summary or score. Third-party tracking sites similarly report reviews and score as not available for the main app, though the separate playtest entry has a small number of reviews that are not reflected on the primary store page. As a result, there is not yet a reliable, aggregated Steam user sentiment label or percentage for the released game.",
      "sources": [
        "https://store.steampowered.com/app/3844970/",
        "https://steamdb.info/app/3844970/",
        "https://games-stats.com/steam/game/burglin-gnomes/",
        "https://steambase.io/games/burglin-gnomes/info",
        "https://steambase.io/apps/burglin-gnomes-playtest"
      ]
    }
  },
  "scoring": {
    "identity_score": 4,
    "anti_cheat_score": 5,
    "community_score": 2,
    "overall_score": 4,
    "overall_summary": "Burglin' Gnomes is an upcoming co-op action-adventure title developed and self-published by indie studio Fobri, which appears to be a legitimate but relatively low-profile developer with limited public corporate background information. The game does not show any signs of additional DRM or invasive anti-cheat beyond standard Steam platform features, which is favorable for privacy- and control-conscious players. However, because the main app has not yet released and lacks a public Steam review summary or percentage, community sentiment is still largely unformed, with only early impressions from a limited playtest and demo. Overall, the project looks promising and technically non-intrusive, but players should be aware that broad user feedback is still emerging."
  }
}