{
  "target": {
    "game_name": "Cloudheim",
    "timestamp_utc": "2025-12-10T00:00:00Z"
  },
  "results": {
    "identity": {
      "developer": "Noodle Cat Games",
      "publisher": "Noodle Cat Games",
      "country": "United States",
      "summary": "Cloudheim is developed and published by Noodle Cat Games, an independent studio that self-publishes the title on PC via Steam and the Epic Games Store. Store pages and press materials consistently list Noodle Cat Games as both developer and publisher, and recent press releases for the game are issued out of the United States, indicating the studio is US-based. Overall, the project presents as a professionally marketed indie co-op action RPG with a clear brand, official website, and active community presence, suggesting a reputable and organized small-to-mid-sized developer.",
      "sources": [
        "https://store.steampowered.com/app/2070270/Cloudheim/",
        "https://store.epicgames.com/en-US/p/cloudheim-9fdc70",
        "https://cloudheimgame.com/",
        "https://www.gematsu.com/games/cloudheim",
        "https://www.gamespress.com/en-US/Physics-driven-co-op-action-RPG-Cloudheim-starts-its-Open-Beta-today"
      ]
    },
    "anti_cheat": {
      "type": "none",
      "classification": "standard",
      "summary": "No explicit anti-cheat or third-party DRM such as Denuvo, Easy Anti-Cheat, or kernel-level drivers is mentioned on the Steam or Epic Games store pages, the official site, or community resources for Cloudheim. The game uses Epic Online Services for networking according to SteamDB, but there is no indication of invasive, always-on or kernel-level anti-cheat beyond typical online connectivity requirements. Based on available information, Cloudheim appears to rely on standard platform DRM and online services without any notably intrusive anti-cheat components.",
      "sources": [
        "https://store.steampowered.com/app/2070270/Cloudheim/",
        "https://store.epicgames.com/en-US/p/cloudheim-9fdc70",
        "https://steamdb.info/app/4017410/",
        "https://cloudheimgame.com/faq/"
      ]
    },
    "community_sentiment": {
      "steam_label": "Mostly Positive",
      "steam_percentage": "75%",
      "summary": "On Steam, Cloudheim currently holds a \"Mostly Positive\" user review summary with approximately 75% of around 187 user reviews marked as positive for the Early Access release, while the separate demo app also sits at a \"Mostly Positive\" rating in the mid-70% range. Early feedback generally praises the colorful art style, physics-driven co-op combat, and variety of builds, while some mixed reviews mention performance demands, balance issues, and the expected rough edges of an Early Access title. Overall sentiment is favorable, indicating that most players enjoy the core gameplay loop and co-op experience despite some early technical and tuning concerns.",
      "sources": [
        "https://store.steampowered.com/app/2070270/Cloudheim/",
        "https://store.steampowered.com/app/4017410/Cloudheim_Demo/",
        "https://steamspy.com/app/2070270",
        "https://steamdb.info/app/4017410/"
      ]
    }
  },
  "scoring": {
    "identity_score": 5,
    "anti_cheat_score": 4,
    "community_score": 4,
    "overall_score": 4,
    "overall_summary": "Cloudheim is a newly released Early Access co-op action RPG developed and self-published by US-based indie studio Noodle Cat Games, with consistent identity information across official and press sources. There is no evidence of invasive or kernel-level anti-cheat or heavy third-party DRM; the game appears to rely on standard platform protections and online services, which should be acceptable to most players. Community reception on Steam is \"Mostly Positive\" at roughly 75% positive reviews, with players responding well to the physics-driven co-op combat and crafting while noting some performance and balance issues typical of Early Access. Overall, Cloudheim looks like a solid, reputable indie project with generally favorable sentiment and no major red flags around ownership or anti-cheat."
  }
}