{
  "target": {
    "game_name": "deadside",
    "timestamp_utc": "2026-01-27T00:00:00Z"
  },
  "results": {
    "identity": {
      "developer": "Bad Pixel",
      "publisher": "Bad Pixel, tinyBuild",
      "country": "Russia",
      "summary": "Deadside is developed by Bad Pixel, a small studio generally reported as Russian-based, and published jointly by Bad Pixel and mid-sized publisher tinyBuild across PC and console platforms. The partnership with tinyBuild, which has a long track record of shipping and supporting AA-scale titles, suggests a reasonably established and commercially focused operation, while Bad Pixel’s multi‑year early access period and continued updates indicate ongoing support and engagement with the game.",
      "sources": [
        "https://www.gematsu.com/games/deadside",
        "https://steambase.io/games/deadside/reviews",
        "https://www.deadsidegame.com/",
        "https://www.wasdland.com/game/deadside-895400/"
      ]
    },
    "anti_cheat": {
      "type": "Easy Anti-Cheat",
      "classification": "standard",
      "summary": "Deadside uses Easy Anti-Cheat (EAC), as indicated by historical Steam community discussions referencing EAC loading with the game and anti-cheat related errors. EAC is a widely used user‑mode anti-cheat solution rather than a kernel‑level driver on most titles, and there is no clear evidence that Deadside employs a more invasive, kernel‑level or always‑on DRM/anti-cheat beyond standard EAC integration. Some players have raised concerns about false positives and how EAC scans for external tools, but overall the implementation appears in line with common multiplayer shooters and is best characterized as standard rather than highly invasive.",
      "sources": [
        "https://steamcommunity.com/app/895400/discussions/0/2284960483090437984/",
        "https://steamcommunity.com/app/895400/discussions/3/3057363335745914422/",
        "https://www.reddit.com/r/deadside/comments/15t77cv/",
        "https://www.reddit.com/r/deadside/comments/1hr7j2c/",
        "https://steamdb.info/app/895400/config/"
      ]
    },
    "community_sentiment": {
      "steam_label": "Mostly Positive",
      "steam_percentage": "76%",
      "summary": "On Steam, Deadside currently holds a \"Mostly Positive\" user review summary, with aggregated trackers such as Steambase reporting roughly a 76% positive rating from around 39,000 total reviews. Community sentiment highlights that players generally appreciate the hardcore survival gunplay, open-world PvP/PvE mix, and the substantial improvements made during and after early access, while recurring criticisms focus on cheaters, balance issues, and the grind or repetition typical of survival shooters.",
      "sources": [
        "https://steambase.io/games/deadside/reviews",
        "https://steambase.io/games/deadside/steam-charts",
        "https://www.wasdland.com/game/deadside-895400/",
        "https://www.pcgamesn.com/deadside/full-launch"
      ]
    }
  },
  "scoring": {
    "identity_score": 4,
    "anti_cheat_score": 3,
    "community_score": 4,
    "overall_score": 4,
    "overall_summary": "Deadside is a multiplayer survival shooter developed by Bad Pixel and published by Bad Pixel in partnership with established publisher tinyBuild, giving it a reasonably solid and reputable backing. The game uses Easy Anti-Cheat, a common and generally accepted solution that can generate some false-positive and privacy concerns but is not typically considered kernel-level or unusually invasive. Steam community sentiment is broadly favorable, with a Mostly Positive rating and mid‑70s approval, reflecting a player base that largely enjoys the core survival and combat loop despite ongoing concerns about cheating and balance. Overall, the title appears reasonably trustworthy and well-received, with standard anti-cheat practices and a stable, if imperfect, community reputation."
  }
}