{
  "target": {
    "game_name": "escape from tarkov",
    "timestamp_utc": "2025-12-01T00:00:00Z"
  },
  "results": {
    "identity": {
      "developer": "Battlestate Games",
      "publisher": "Battlestate Games",
      "country": "Russia",
      "summary": "Escape from Tarkov is developed and self-published by Battlestate Games, a Russian studio based in Saint Petersburg that has been working on the title since its early alpha period. The company is relatively small but long-established around this single flagship game, with a reputation for ambitious, hardcore design and also for controversial business and communication decisions. Overall, it is a known and specialized developer rather than a broad, multi-franchise publisher.",
      "sources": [
        "https://store.steampowered.com/app/3932890/Escape_from_Tarkov/",
        "https://www.metacritic.com/game/escape-from-tarkov/",
        "https://en.wikipedia.org/wiki/Escape_from_Tarkov"
      ]
    },
    "anti_cheat": {
      "type": "proprietary / unknown (no major third‑party like EAC/Battleye/Denuvo listed)",
      "classification": "standard",
      "summary": "Public listings for Escape from Tarkov, including its new Steam page, do not advertise any third‑party DRM such as Denuvo or kernel‑level anti‑cheat like EAC or Battleye. Historically the game has used its own server‑side and client‑side anti‑cheat mechanisms tied to Battlestate’s launcher and account system, and recent coverage mentions new anti‑cheat measures and player reporting incentives but does not indicate kernel‑level drivers. Based on available information, Tarkov appears to rely on proprietary, service‑based anti‑cheat that is typical for an online-only shooter and not clearly more invasive than standard industry practice, though exact technical details remain undisclosed.",
      "sources": [
        "https://store.steampowered.com/app/3932890/Escape_from_Tarkov/",
        "https://www.pcgamingwiki.com/wiki/Escape_from_Tarkov",
        "https://www.gamesradar.com/games/fps/after-announcing-escape-from-tarkov-is-finally-leaving-early-access-the-extraction-shooter-dev-has-confirmed-a-page-on-steam-will-be-available-soon/",
        "https://www.pcgamer.com/games/fps/escape-from-tarkov-1-0-release-date/"
      ]
    },
    "community_sentiment": {
      "steam_label": "Mixed",
      "steam_percentage": "57%",
      "summary": "On Steam, Escape from Tarkov currently holds a Mixed user review label, with about 57% of roughly 6,300 English-language reviews marked positive and a similar overall rating across all languages. Players consistently praise its deep, high-stakes extraction gameplay and detailed gun mechanics, but many negative reviews focus on server instability and long queues around the 1.0/Steam launch, technical issues, perceived poor support and monetization decisions, and ongoing concerns about cheating. Overall sentiment is polarized: highly enthusiastic among fans of hardcore tactical shooters, but notably critical among players frustrated by technical and business-side problems.",
      "sources": [
        "https://store.steampowered.com/app/3932890/Escape_from_Tarkov/",
        "https://steamdb.info/app/3932890/",
        "https://www.metacritic.com/game/escape-from-tarkov/user-reviews/"
      ]
    }
  },
  "scoring": {
    "identity_score": 4,
    "anti_cheat_score": 3,
    "community_score": 2,
    "overall_score": 3,
    "overall_summary": "Escape from Tarkov is a long-running hardcore extraction shooter developed and self-published by Russian studio Battlestate Games, which is well known and focused almost entirely on this title. The game appears to use its own account-based, service-side anti-cheat rather than branded kernel-level solutions or heavy third-party DRM, suggesting a standard level of intrusiveness, though technical specifics are not fully transparent. Community sentiment on Steam is sharply divided, with a Mixed rating and around 57% positive reviews: dedicated players value its unique, punishing gameplay and depth, while many others criticize technical issues, server reliability, cheating concerns, and controversial business decisions. Overall, Tarkov is recommended primarily for players who specifically want a demanding, niche tactical FPS and are willing to tolerate rough edges and ongoing controversy."
  }
}