{
  "target": {
    "game_name": "PUBG: BATTLEGROUNDS",
    "timestamp_utc": "2025-11-29T00:00:00Z"
  },
  "results": {
    "identity": {
      "developer": "PUBG Corporation (PUBG Studios, a division of KRAFTON, Inc.)",
      "publisher": "KRAFTON, Inc.",
      "country": "South Korea",
      "summary": "PUBG: BATTLEGROUNDS is developed by PUBG Corporation (now commonly referred to as PUBG Studios), a subsidiary of South Korean game company KRAFTON, Inc., which also serves as the game’s global publisher. KRAFTON is a large, publicly visible publisher with multiple major online titles and a long-running live‑service operation for PUBG across PC, console, and mobile. The company maintains official support portals and regular update and anti‑cheat notices, indicating an established and professionally run operation that aligns with expectations for a flagship, mainstream online shooter.",
      "sources": [
        "https://store.steampowered.com/app/578080/PUBG_BATTLEGROUNDS/",
        "https://en.wikipedia.org/wiki/PUBG:_Battlegrounds",
        "https://krafton.com/en/studios/pubg-studios/",
        "https://support.pubg.com/"
      ]
    },
    "anti_cheat": {
      "type": "KSS (Krafton Security Services), kernel-level anti-cheat",
      "classification": "invasive",
      "summary": "On its Steam store page, PUBG: BATTLEGROUNDS explicitly notes that it \"Uses Kernel Level Anti-Cheat\" and identifies this system as KSS (Krafton Security Services). Kernel‑level anti‑cheat operates with very high privileges on the user’s system, which is generally considered more invasive than standard user‑mode anti‑cheat or simple online checks. While this approach is common among competitive shooters seeking stronger cheat prevention, it does mean the game’s protection runs at a deep system level, so it is best classified here as invasive DRM/anti‑cheat rather than a lightweight or purely server‑side solution.",
      "sources": [
        "https://store.steampowered.com/app/578080/PUBG_BATTLEGROUNDS/",
        "https://store.steampowered.com/app/578080/",
        "https://pubg.com/en/news/9461",
        "https://comicbook.com/gaming/news/new-pubg-batttlegrounds-anti-cheat-bans-how-to-report/"
      ]
    },
    "community_sentiment": {
      "steam_label": "Mixed (overall), Mostly Positive (recent)",
      "steam_percentage": "Approximately 65% positive overall, ~70% positive recent",
      "summary": "On Steam, PUBG: BATTLEGROUNDS currently shows an overall \"Mixed\" user review summary with roughly 2.6 million total reviews and about 65% of English reviews marked positive, while recent reviews over the last 30 days are labeled \"Mostly Positive\" at around 69–70% positive. This suggests a large, long‑running player base with a history of mixed feedback—often citing issues like performance, monetization, or cheating—but with more recent sentiment skewing somewhat more favorable as ongoing updates, events, and balance changes land better with active players.",
      "sources": [
        "https://store.steampowered.com/app/578080/PUBG_BATTLEGROUNDS/",
        "https://store.steampowered.com/app/578080/",
        "https://steamdb.info/app/578080/graphs/"
      ]
    }
  },
  "scoring": {
    "identity_score": 10,
    "anti_cheat_score": 6,
    "community_score": 7,
    "overall_score": 8,
    "overall_summary": "PUBG: BATTLEGROUNDS is a major, long‑standing online battle royale title developed by PUBG Corporation/PUBG Studios and published globally by South Korean company KRAFTON, Inc., both of which are well‑established and operate extensive live‑service infrastructure. The game employs KSS (Krafton Security Services), a kernel‑level anti‑cheat solution that is effective but inherently invasive compared with standard user‑mode or purely server‑side protections. Community sentiment on Steam is broadly mixed over the game’s long life, with about 65% positive overall but more recent reviews trending mostly positive around 70%, reflecting a huge, engaged player base that continues to surface concerns about performance, cheating, and monetization even as many players still enjoy the core gameplay and ongoing updates."
  }
}