{
  "target": {
    "game_name": "rocket league",
    "timestamp_utc": "2026-02-16T00:00:00Z"
  },
  "results": {
    "identity": {
      "developer": "Psyonix LLC",
      "publisher": "Psyonix LLC",
      "country": "United States",
      "summary": "Rocket League is developed and published by Psyonix LLC, an American studio based in San Diego, California. Psyonix has been active since 2001 and is now part of Epic Games, with a long track record contributing to major franchises like Unreal Tournament, Gears of War, and Mass Effect before finding breakout success with Rocket League. The company appears established and reputable, with strong ongoing support for the game and its esports ecosystem.",
      "sources": [
        "https://en.wikipedia.org/wiki/Rocket_League",
        "https://www.psyonix.com/",
        "https://steambase.io/games/rocket-league/reviews",
        "https://steambase.io/publishers/psyonix-llc",
        "https://www.videogameschronicle.com/companies/epic-games/psyonix/"
      ]
    },
    "anti_cheat": {
      "type": "Easy Anti-Cheat (planned) plus proprietary systems",
      "classification": "standard",
      "summary": "Historically, Rocket League has relied on its own proprietary, largely server-side anti-cheat and did not use Easy Anti-Cheat. Recent community and guide sources describe this in-house system as non-invasive and focused on monitoring game state and behavior rather than kernel-level access. As of February 16, 2026, Psyonix has announced that Easy Anti-Cheat (EAC) will be added on PC for Season 22, with players able to toggle EAC on or off, but with EAC required for online matchmaking and tournaments. EAC is a widely used, user-mode anti-cheat solution and is generally considered standard rather than highly invasive, especially compared to kernel-level systems. Overall, Rocket League’s anti-cheat approach appears typical for a competitive online title and not unusually intrusive, though the upcoming EAC integration will tighten cheat detection and may limit some mod usage when enabled.",
      "sources": [
        "https://www.gameslearningsociety.org/does-rocket-league-use-easy-anti-cheat/",
        "https://www.reddit.com/r/RocketLeague/comments/1r6gp5e/easy_anticheat_coming_to_rocket_league_in_april/",
        "https://www.reddit.com/r/RocketLeague/comments/1lql5aa/easy_anti_cheat/",
        "https://attendance.sindhhealth.gov.pk/free-area/rocket-league-bot-unlocking-the-unknown-cheats-1764803075",
        "https://www.easyeac.com/"
      ]
    },
    "community_sentiment": {
      "steam_label": "Very Positive",
      "steam_percentage": "88%",
      "summary": "On Steam, Rocket League holds a \"Very Positive\" overall user review label, with around 88% of roughly 575k–580k reviews being positive. Long-term players frequently praise its core car-soccer gameplay loop, depth, and replayability, often calling it one of the best competitive games they’ve played. Common criticisms focus on matchmaking quality, perceived toxicity, server performance, and dissatisfaction with some monetization decisions (such as the removal of item trading and Epic-era changes). Despite these issues, the overall sentiment remains strongly favorable, and the game continues to maintain a large, active player base years after release.",
      "sources": [
        "https://steambase.io/games/rocket-league/reviews",
        "https://live-player-count.com/game/rocket-leaguer",
        "https://steamcharts.com/app/252950",
        "https://www.pcgamesn.com/rocket-league/rocket-league-player-count"
      ]
    }
  },
  "scoring": {
    "identity_score": 5,
    "anti_cheat_score": 4,
    "community_score": 5,
    "overall_score": 5,
    "overall_summary": "Rocket League is a long-running, highly successful competitive sports-action game developed and published by Psyonix LLC, an established U.S. studio now owned by Epic Games. The developer is reputable and has supported the title for many years across content updates and esports initiatives. Historically, Rocket League used a proprietary, mostly server-side anti-cheat system that was not considered invasive; Psyonix is now rolling out Easy Anti-Cheat on PC for online play, a standard industry solution that should improve cheat detection without resorting to kernel-level monitoring. Community sentiment on Steam is strongly positive, with a Very Positive rating and roughly 88% positive reviews, reflecting enduring appreciation for the core gameplay despite ongoing complaints about matchmaking, toxicity, and monetization changes. Overall, the game scores highly across identity, anti-cheat, and community dimensions and is broadly recommended."
  }
}