{
  "target": {
    "game_name": "war thunder",
    "timestamp_utc": "2025-11-29T00:00:00Z"
  },
  "results": {
    "identity": {
      "developer": "Gaijin Entertainment",
      "publisher": "Gaijin Network Ltd",
      "country": "Hungary",
      "summary": "War Thunder is developed by Gaijin Entertainment and published on Steam by Gaijin Network Ltd. Gaijin is an established European studio founded in 2002, now headquartered in Budapest, Hungary, with multiple offices across Europe and the Middle East. The company is best known for large-scale online titles like War Thunder, Crossout, and Enlisted, and has a long track record of shipping and operating live-service games. While the studio is reputable and experienced from a production standpoint, community discussions often highlight concerns around monetization and balance rather than basic trust in the company’s existence or capabilities.",
      "sources": [
        "https://store.steampowered.com/app/236390/War_Thunder/",
        "https://www.gaijinent.com/about",
        "https://en.wikipedia.org/wiki/Gaijin_Entertainment"
      ]
    },
    "anti_cheat": {
      "type": "BattlEye (kernel-level)",
      "classification": "invasive",
      "summary": "On Steam, War Thunder explicitly lists the use of BattlEye with a note that it uses kernel-level anti-cheat and that BattlEye requires manual removal after uninstalling the game. Kernel-level anti-cheat solutions are generally considered more invasive because they operate with high system privileges and remain installed unless manually removed. There is no indication of additional DRM layers like Denuvo on the Steam page, so the primary concern is the kernel-level BattlEye component rather than extra executable-based DRM.",
      "sources": [
        "https://store.steampowered.com/app/236390/War_Thunder/",
        "https://www.pcgamingwiki.com/wiki/War_Thunder"
      ]
    },
    "community_sentiment": {
      "steam_label": "Mostly Positive",
      "steam_percentage": "74%",
      "summary": "As of late November 2025, War Thunder’s overall Steam user review summary is \"Mostly Positive,\" with approximately 74% of all user reviews marked positive and around 79% positive in the most recent 30-day window. Despite the broadly positive aggregate score, the game has experienced multiple waves of review bombing tied to controversial monetization and economy changes, as well as more recent backlash over an in-game auction system. Long-term players often praise the depth of vehicle rosters, combined arms combat, and frequent content updates, while criticism frequently targets grind intensity, perceived pay-to-progress or pay-to-win elements, and balance decisions. Overall sentiment is cautiously positive but volatile, with strong opinions on both sides.",
      "sources": [
        "https://store.steampowered.com/app/236390/War_Thunder/",
        "https://steamdb.info/app/236390/",
        "https://gameworldobserver.com/2023/05/24/war-thunder-review-bombing-monetization-economy-gaijin",
        "https://www.pcgamer.com/games/action/war-thunder-players-take-a-break-from-leaking-classified-information-to-review-bomb-their-beloved-game-for-adding-an-auction-house/",
        "https://www.pcgamesn.com/war-thunder/auction-backlash"
      ]
    }
  },
  "scoring": {
    "identity_score": 5,
    "anti_cheat_score": 2,
    "community_score": 3,
    "overall_score": 3,
    "overall_summary": "War Thunder is a long-running, free-to-play MMO military combat game developed by Gaijin Entertainment and published by Gaijin Network Ltd, with the company headquartered in Hungary and operating multiple international offices. Identity and ownership details are clear and well-documented, indicating an established and reputable studio from a production standpoint. The game uses BattlEye kernel-level anti-cheat, which is generally regarded as invasive due to its deep system access and persistence after uninstall, lowering its anti-cheat/DRM friendliness score. On Steam, War Thunder holds a \"Mostly Positive\" overall rating with roughly three-quarters of reviews being positive, but its community sentiment is mixed in practice, with recurring review-bombing episodes and strong criticism of monetization, grind, and balance. Taken together, the game scores well on identity transparency, poorly on intrusiveness of anti-cheat, and moderately on community sentiment, resulting in an overall middling assessment."
  }
}